output: default
streamtags:
  - ocsf
  - authentication
  - okta
  - v1.3.0
groups: {}
asyncFuncTimeout: 1000
functions:
  - id: comment
    filter: "true"
    disabled: null
    conf:
      comment: Parse raw and put into parsed field
  - id: serde
    filter: typeof(_raw) == 'string'
    disabled: null
    conf:
      mode: extract
      type: json
      srcField: _raw
      fieldFilterExpr: value !== '' && value !== null
      dstField: parsed
    final: false
  - id: comment
    filter: "true"
    disabled: null
    conf:
      comment: Flatten parsed field
  - id: flatten
    filter: "true"
    disabled: null
    conf:
      fields:
        - parsed
      prefix: ""
      depth: 10
      delimiter: .
  - id: comment
    filter: "true"
    disabled: null
    conf:
      comment: Match flattened field names to those in the C.var dictionary and rename
        them
  - id: code
    filter: "true"
    disabled: null
    conf:
      maxNumOfIterations: 5000
      activeLogSampleRate: 1
      useUniqueLogChannel: true
      code: >-
        // this function takes the flattened field names

        // looks them up in the specified Global Variable (Knowledge -> Global Variables)

        // renames them accordingly

        // and finally unflattens them into ocsf{}


        // update this to reflect the conversion you want

        const gv = C.vars.ocsf_4009_proofpoint_tap


        const debug = false

        function unflatten(data) {
          var result = {}
          for (var i in data) {
            var keys = i.split('.')
            keys.reduce(function(r, e, j) {
              return r[e] || (r[e] = isNaN(Number(keys[j + 1])) ? (keys.length - 1 == j ? data[i] : {}) : [])
            }, result)
          }
          return result
        }



        try {
           __e.ocsf = {}
           debug && (__e.debug = [])
           for (let [name, value] of Object.entries(__e)) {
              debug && __e.debug.push(name)
              if (name.startsWith('parsed.')) {
                 let old_name = name.slice(7)
                 let new_name = gv[old_name]
                 debug && __e.debug.push(`map: ${old_name} -> ${new_name}`)
                 if (new_name) {
                    __e.ocsf[new_name] = value
                    delete __e[name]
                 } else {
                    __e.ocsf[`unmapped.extras.${old_name}`] = value
                    delete __e[name]
                 }
              }
           }
           // now unflatten the result
           Object.assign(__e,unflatten(__e.ocsf))
           delete __e.ocsf
        } catch (err) {
           __e.CRIBLERR = err.toString()
        }
  - id: comment
    filter: "true"
    disabled: null
    conf:
      comment: Make sure time is a number
  - id: auto_timestamp
    filter: "true"
    disabled: null
    conf:
      srcField: time
      dstField: time
      defaultTimezone: local
      timeExpression: time.getTime() / 1000
      offset: 0
      maxLen: 150
      defaultTime: now
      latestDateAllowed: +1week
      earliestDateAllowed: -420weeks
  - id: comment
    filter: "true"
    disabled: null
    conf:
      comment: Fix-up required fields and types
  - id: eval
    filter: "true"
    disabled: null
    conf:
      add:
        - name: action
          value: "cribl_breaker.endsWith('ages Blocked') ? 'Denied' : null"
        - name: action
          value: "cribl_breaker.endsWith('Delivered') ? 'Allowed' : action"
        - name: action
          value: "cribl_breaker.endsWith('Permitted') ? 'Allowed' : action"
        - name: action
          value: "cribl_breaker.endsWith('cks Blocked') ? 'Denied' : action"
        - disabled: false
          name: action_id
          value: "action == 'Allowed' ? 1 : action == 'Denied' ? 2 : 99"
  - id: eval
    filter: "true"
    disabled: null
    conf:
      remove:
        - _raw
        - _time
        - cribl*
        - unmapped.extras.fromAddress
        - unmapped.extras.toAddresses
      add:
        - disabled: false
          name: time
          value: Math.round(time,0)
        - disabled: false
          name: metadata
          value: "{product: {}}"
        - disabled: false
          name: metadata.product.vendor_name
          value: 'metadata.product.vendor_name ? metadata.product.vendor_name : "unknown"'
        - disabled: false
          name: metadata.version
          value: 'metadata.version ? metadata.version : "1.3.0"'
        - disabled: false
          name: activity_id
          value: 3 /* all events here are scan-based */
        - disabled: false
          name: category_uid
          value: "4"
        - disabled: false
          name: class_uid
          value: "4009"
        - disabled: false
          name: severity_id
          value: 1 /* guessing info level */
        - disabled: false
          name: type_uid
          value: class_uid * 100 + activity_id
        - disabled: false
          value: unmapped.extras.toAddresses
          name: email.to
        - disabled: false
          name: email.from
          value: unmapped.extras.fromAddress[0]
        - disabled: false
          name: direction_id
          value: 0 /* 0 unk, 1 in, 2 out, 3 internal, 99 other */
        - disabled: false
          name: direction
          value: '"Unknown"'
  - id: eval
    filter: "true"
    disabled: null
    conf:
      remove:
        - _raw
    final: true
    description: DEBUG - STOP HERE
description: Convert user authentication logs to OCSF schema
